app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-07-26 02:54:55.688603"], ["updated_at", "2019-07-26 02:54:55.688603"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def show
    @school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-07-26 03:00:34.856810"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by(params[:id])
    @school_class.update(school_class_params(:title, :room_number))