app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-07-26 02:54:55.711963"], ["updated_at", "2019-07-26 02:54:55.711963"]]
---
  def create
    @student = Student.new(school_class_params(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def show
    @student = Student.find_by(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @student = Student.find_by(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-07-26 03:03:59.852554"], ["id", 1]]
---
  def update
    @student = Student.find_by(params[:id])
    @student.update(student_params(:first_name, :last_name))